-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Фев 14 2021 г., 22:23
-- Версия сервера: 10.4.17-MariaDB
-- Версия PHP: 8.0.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `lab1`
--

-- --------------------------------------------------------

--
-- Структура таблицы `books`
--

CREATE TABLE `books` (
  `b_id` int(11) NOT NULL,
  `b_code` int(11) DEFAULT NULL,
  `b_new` varchar(3) DEFAULT NULL,
  `b_title` varchar(50) DEFAULT NULL,
  `b_price` int(11) DEFAULT NULL,
  `b_publishing` varchar(40) DEFAULT NULL,
  `b_pages` int(11) DEFAULT NULL,
  `b_format` varchar(30) DEFAULT NULL,
  `b_data` date DEFAULT NULL,
  `b_circulation` int(11) DEFAULT NULL,
  `b_topic` varchar(50) DEFAULT NULL,
  `b_category` varchar(20) DEFAULT NULL,
  `b_author` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `books`
--

INSERT INTO `books` (`b_id`, `b_code`, `b_new`, `b_title`, `b_price`, `b_publishing`, `b_pages`, `b_format`, `b_data`, `b_circulation`, `b_topic`, `b_category`, `b_author`) VALUES
(2, 5110, 'No', 'Аппаратные средства мультимедия. Видеосистема РС', 0, 'BHV С,-Петербург', 400, '70х100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Підручники\r', NULL),
(8, 4985, 'No', 'Освой самостоятельно модернизацию и ремонт ПК за 2', 0, 'Вильямс', 288, '70х100/16', '2000-07-07', 5000, 'Використання ПК в цілому', 'Підручники\r', NULL),
(9, 5141, 'No', 'Структуры данных и алгоритмы,', 0, 'Вильямс', 384, '70х100/16', '2000-09-29', 5000, 'Використання ПК в цілому', 'Підручники\r', NULL),
(20, 5127, 'Yes', 'Автоматизация инженерно- графических работ', 0, 'Питер', 256, '70х100/16', '2000-06-15', 5000, 'Використання ПК в цілому', 'Підручники\r', NULL),
(31, 5110, 'No', 'Аппаратные средства мультимедия, Видеосистема РС', 0, 'BHV С,-Петербург', 400, '70х100/16', '2000-07-24', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК\r', NULL),
(46, 5199, 'No', 'Железо IBM 2001, ', 0, 'МикроАрт', 368, '70х100/16', '2000-12-02', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК\r', NULL),
(50, 3851, 'Yes', 'Защита информации и безопасность компьютерных сист', 0, 'DiaSoft', 480, '84х108/16', '1999-02-04', 5000, 'Використання ПК в цілому', 'Захист і безпека ПК\r', NULL),
(58, 3932, 'No', 'Как превратить персональный компьютер в измеритель', 0, 'ДМК', 144, '60х88/16', '1999-06-09', 5000, 'Використання ПК в цілому', 'Інші книги\r', NULL),
(59, 4713, 'No', 'Plug- ins, Встраиваемые приложения для музыкальных', 0, 'ДМК', 144, '70х100/16', '2000-02-22', 5000, 'Використання ПК в цілому', 'Інші книги\r', NULL),
(175, 5217, 'No', ' Windows МЕ, Новейшие версии программ', 0, 'Триумф', 320, '70х100/16', '2000-08-25', 5000, 'Операційні системи', 'Windows 2000\r', NULL),
(176, 4829, 'No', 'Windows 2000 Professional шаг за шагом с СD', 0, 'Эком', 320, '70х100/16', '2000-04-28', 5000, 'Операційні системи', 'Windows 2000\r', NULL),
(188, 5170, 'No', 'Linux Русские версии', 0, 'ДМК', 346, '70х100/16', '2000-09-29', 5000, 'Операційні системи', 'Linux\r', NULL),
(191, 860, 'No', 'Операционная система UNIX', 0, 'BHV С,-Петербург', 395, '84х10016', '1997-05-05', 5000, 'Операційні системи', 'Unix\r', NULL),
(203, 44, 'No', 'Ответы на актуальные вопросы по OS/2 Warp', 0, 'DiaSoft', 352, '60х84/16', '1996-03-20', 5000, 'Операційні системи', 'Інші операційні сист', NULL),
(206, 5176, 'No', 'Windows Ме, Спутник пользователя', 0, 'Русская редакция', 306, '', '2000-10-10', 5000, 'Операційні системи', 'Інші операційні сист', NULL),
(209, 5462, 'No', 'Язык программирования С++, Лекции и упражнения', 0, 'DiaSoft', 656, '84х108/16', '2000-12-12', 5000, 'Програмування', 'C&C++\r', NULL),
(210, 4982, 'No', 'Язык программирования С, Лекции и упражнения', 0, 'DiaSoft', 432, '84х108/16', '2000-07-12', 5000, 'Програмування', 'C&C++\r', NULL),
(220, 4687, 'No', 'Эффективное использование C++ ,50 рекомендаций по ', 0, 'ДМК', 240, '70х100/16', '2000-02-03', 5000, 'Програмування', 'C&C++\r', NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`b_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `books`
--
ALTER TABLE `books`
  MODIFY `b_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=221;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
